//NIGHTLY  JOB (FFB,0100),'NIGHTLY POSTING',CLASS=A,MSGCLASS=X
//*
//* FIRST FRONTIER BANK - NIGHTLY DEPOSIT POSTING CYCLE
//*
//*   SORTTRN   SORT THE DAY'S FEED INTO ACCOUNT/TIME SEQUENCE
//*   VALIDATE  EDIT THE FEED, REJECT BAD RECORDS          RC 4 = REJECTS
//*   POST      APPLY TRANSACTIONS TO THE MASTER (BALANCED LINE)
//*   INTEREST  DAILY ACCRUAL, MONTH-END CREDIT -> ACCTMAST(+1)
//*   GLRECON   PROVE THE CYCLE BALANCES               RC 8 = HOLD
//*   STMTGEN   PRINT CUSTOMER STATEMENTS
//*   ARCHIVE   KEEP A COPY OF THE FEED IN HISTORY
//*   CLEANUP   CONSUME THE FEED SO IT CANNOT BE POSTED TWICE
//*
//* COND=(4,LT) ON EVERY STEP: BYPASS IF ANY EARLIER STEP ENDED > RC 4.
//* OVERRIDE THE DATE WITH: frontier submit NIGHTLY.jcl --set BUSDATE=...
//*
//         SET BUSDATE=20260929
//*
//SORTTRN  EXEC PGM=SORT
//SORTIN   DD DSN=FFB.DAILY.TRANFEED,DISP=SHR
//SORTOUT  DD DSN=&&SORTED,DISP=(NEW,PASS),RECFM=FB,LRECL=80
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
  SORT FIELDS=(1,10,CH,A,11,14,CH,A)
/*
//*
//VALIDATE EXEC PGM=TRNVALID,PARM='&BUSDATE',COND=(4,LT)
//TRANIN   DD DSN=&&SORTED,DISP=(OLD,DELETE)
//TRANOUT  DD DSN=&&VALID,DISP=(NEW,PASS),RECFM=FB,LRECL=80
//REJECTS  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
//POST     EXEC PGM=ACCTPOST,COND=(4,LT)
//ACCTOLD  DD DSN=FFB.ACCTMAST(0),DISP=SHR
//TRANIN   DD DSN=&&VALID,DISP=(OLD,DELETE)
//ACCTNEW  DD DSN=&&POSTED,DISP=(NEW,PASS),RECFM=FB,LRECL=100
//POSTLOG  DD DSN=FFB.DAILY.POSTLOG(+1),DISP=(NEW,CATLG,DELETE),
//            RECFM=FB,LRECL=100
//SYSOUT   DD SYSOUT=*
//*
//INTEREST EXEC PGM=INTCALC,PARM='&BUSDATE',COND=(4,LT)
//ACCTIN   DD DSN=&&POSTED,DISP=(OLD,DELETE)
//ACCTOUT  DD DSN=FFB.ACCTMAST(+1),DISP=(NEW,CATLG,DELETE),
//            RECFM=FB,LRECL=100
//INTLOG   DD DSN=FFB.DAILY.INTLOG(+1),DISP=(NEW,CATLG,DELETE),
//            RECFM=FB,LRECL=50
//SYSOUT   DD SYSOUT=*
//*
//GLRECON  EXEC PGM=GLRECON,PARM='&BUSDATE',COND=(4,LT)
//ACCTOLD  DD DSN=FFB.ACCTMAST(0),DISP=SHR
//ACCTNEW  DD DSN=FFB.ACCTMAST(+1),DISP=SHR
//POSTLOG  DD DSN=FFB.DAILY.POSTLOG(+1),DISP=SHR
//INTLOG   DD DSN=FFB.DAILY.INTLOG(+1),DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
//STMTGEN  EXEC PGM=STMTGEN,PARM='&BUSDATE',COND=(4,LT)
//ACCTIN   DD DSN=FFB.ACCTMAST(+1),DISP=SHR
//POSTLOG  DD DSN=FFB.DAILY.POSTLOG(+1),DISP=SHR
//STMTRPT  DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//*
//ARCHIVE  EXEC PGM=IEBGENER,COND=(4,LT)
//SYSUT1   DD DSN=FFB.DAILY.TRANFEED,DISP=SHR
//SYSUT2   DD DSN=FFB.HIST.TRANFEED(+1),DISP=(NEW,CATLG,DELETE)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
//*
//CLEANUP  EXEC PGM=IEFBR14,COND=(4,LT)
//TRANFEED DD DSN=FFB.DAILY.TRANFEED,DISP=(OLD,DELETE)
